
## Terraform plan for environment: `dev`

**Commit:** 3dc849c6e6cef0449bca185204d7400d9aceba4a


**API version:** 9c7e0c865a
**CLI version:** 9c7e0c865a
**Selfserve version:** release-v6.1.4
**Internal version:** 94f1a9e0de

### Plan summary

`1 to add, 6 to change, 0 to destroy`

**🆕 Creates**

```tf
module.service.module.ecs_service["pdf-converter"].aws_ecs_task_definition.this[0]
```
**📖 Reads**

```tf
module.service.module.ecs_service["pdf-converter"].data.aws_ecs_task_definition.this[0]
module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0]
```
**🔄 Updates**

```tf
module.service.module.batch.aws_batch_job_definition.this["import-anondb"]
module.service.module.batch.aws_batch_job_definition.this["ni-compliance"]
module.service.module.batch.aws_batch_job_definition.this["populate-anondb"]
module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"]
module.service.module.ecs_service["pdf-converter"].aws_ecs_service.this[0]
module.service.module.eventbridge.aws_iam_policy.additional_inline[0]
```


----

<details data-gh-workflow="dev-environment-plan"><summary>Show full plan</summary>

```tf


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.service.module.batch.aws_batch_job_definition.this["import-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:246" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "9c7e0c865a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "9c7e0c865a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:246"
        name                       = "vol-app-dev-import-anondb"
      ~ revision                   = 246 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["ni-compliance"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:246" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "9c7e0c865a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "9c7e0c865a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:246"
        name                       = "vol-app-dev-ni-compliance"
      ~ revision                   = 246 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["populate-anondb"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:246" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "9c7e0c865a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "9c7e0c865a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:246"
        name                       = "vol-app-dev-populate-anondb"
      ~ revision                   = 246 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.batch.aws_batch_job_definition.this["sas-mi-extract"] will be updated in-place
  ~ resource "aws_batch_job_definition" "this" {
      ~ arn                        = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:246" -> (known after apply)
      ~ container_properties       = jsonencode(
          ~ {
              ~ environment                  = [
                  - {
                      - name  = "APP_VERSION"
                      - value = "9c7e0c865a"
                    },
                  - {
                      - name  = "DOMAIN"
                      - value = "dev-dvsacloud.uk"
                    },
                    {
                        name  = "ENVIRONMENT_NAME"
                        value = "DEV"
                    },
                    {
                        name  = "FULL_DOMAIN"
                        value = "dev.olcs.dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "DOMAIN"
                      + value = "dev-dvsacloud.uk"
                    },
                  + {
                      + name  = "READDB_HOST"
                      + value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                    {
                        name  = "PROXY"
                        value = "proxy.dev.olcs.dev-dvsacloud.uk:3128"
                    },
                  + {
                      + name  = "APP_VERSION"
                      + value = "9c7e0c865a"
                    },
                    {
                        name  = "READDB_HOST"
                        value = "olcsreaddb-rds.dev.olcs.dev-dvsacloud.uk"
                    },
                ]
              ~ logConfiguration             = {
                  - secretOptions = []
                    # (2 unchanged attributes hidden)
                }
              - mountPoints                  = []
              - ulimits                      = []
              - volumes                      = []
                # (8 unchanged attributes hidden)
            }
        )
        id                         = "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:246"
        name                       = "vol-app-dev-sas-mi-extract"
      ~ revision                   = 246 -> (known after apply)
        tags                       = {}
        # (10 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["pdf-converter"].data.aws_ecs_task_definition.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_ecs_task_definition" "this" {
      + arn                      = (known after apply)
      + arn_without_revision     = (known after apply)
      + container_definitions    = (known after apply)
      + cpu                      = (known after apply)
      + enable_fault_injection   = (known after apply)
      + ephemeral_storage        = (known after apply)
      + execution_role_arn       = (known after apply)
      + family                   = (known after apply)
      + id                       = (known after apply)
      + inference_accelerator    = (known after apply)
      + ipc_mode                 = (known after apply)
      + memory                   = (known after apply)
      + network_mode             = (known after apply)
      + pid_mode                 = (known after apply)
      + placement_constraints    = (known after apply)
      + proxy_configuration      = (known after apply)
      + requires_compatibilities = (known after apply)
      + revision                 = (known after apply)
      + runtime_platform         = (known after apply)
      + status                   = (known after apply)
      + task_definition          = "vol-app-dev-pdf-converter-service"
      + task_role_arn            = (known after apply)
      + volume                   = (known after apply)
    }

  # module.service.module.ecs_service["pdf-converter"].aws_ecs_service.this[0] will be updated in-place
  ~ resource "aws_ecs_service" "this" {
        id                                 = "arn:aws:ecs:eu-west-1:054614622558:service/vol-app-dev-pdf-converter-cluster/vol-app-dev-pdf-converter-service"
        name                               = "vol-app-dev-pdf-converter-service"
        tags                               = {}
      ~ task_definition                    = "vol-app-dev-pdf-converter-service:2" -> (known after apply)
        # (17 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.service.module.ecs_service["pdf-converter"].aws_ecs_task_definition.this[0] must be replaced
+/- resource "aws_ecs_task_definition" "this" {
      ~ arn                      = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-pdf-converter-service:2" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:eu-west-1:054614622558:task-definition/vol-app-dev-pdf-converter-service" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                    name                   = "pdf-converter"
                  ~ portMappings           = [
                      ~ {
                          ~ containerPort = 8080 -> 3000
                            name          = "http"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (17 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ enable_fault_injection   = false -> (known after apply)
      ~ id                       = "vol-app-dev-pdf-converter-service" -> (known after apply)
      ~ revision                 = 2 -> (known after apply)
      - tags                     = {} -> null
        # (12 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.service.module.eventbridge.data.aws_iam_policy_document.additional_inline[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "additional_inline" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "batch:SubmitJob",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-removal:14",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-liquibase:7",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:304",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-ecmt-accept:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-general:306",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-irhp-allocate:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-generation:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-print:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-print:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-psv-operator-list-export:307",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-remove-read-audit:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-resolve-payments:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-system-parameter:303",
              + "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-transxchange-consumer:306",
              + "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default",
              + "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-liquibase",
              + (known after apply),
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "batch"
        }
    }

  # module.service.module.eventbridge.aws_iam_policy.additional_inline[0] will be updated in-place
  ~ resource "aws_iam_policy" "additional_inline" {
        id               = "arn:aws:iam::054614622558:policy/vol-app-dev-batch-scheduler-inline"
        name             = "vol-app-dev-batch-scheduler-inline"
      ~ policy           = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "batch:SubmitJob"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-liquibase",
                          - "arn:aws:batch:eu-west-1:054614622558:job-queue/vol-app-dev-default",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-transxchange-consumer:306",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-system-parameter:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-sas-mi-extract:246",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-resolve-payments:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-remove-read-audit:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-psv-operator-list-export:307",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-print:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-print:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-permit-generation:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-irhp-allocate:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-general:306",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-ecmt-accept:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-print:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-disc-generation:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-queue-community-licences:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-ntu:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-insolvency-dlq:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-inbox:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-company-profile:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-process-cl:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-populate-anondb:246",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ni-compliance:246",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-mark-expired-permits:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-liquibase:7",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-licence-status-rules:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-last-tm-letter:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-international-goods-export:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-interim-end-date-enforcement:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-inspection-request-email:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-users-from-csv:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-import-anondb:246",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-flag-urgent-tasks:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-expire-bus-registration:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-enqueue-ch-compare:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-warning:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-duplicate-vehicle-removal:14",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-digital-continuation-reminders:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-database-maintenance:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-precheck:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-postcheck:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-populate:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-data-retention-delete:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-create-psv-licence-surrender-task:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-company-profile-dlq:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cns:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-close-expired-windows:304",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-clean-up-variations:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-ch-vs-olcs-diffs:303",
                          - "arn:aws:batch:eu-west-1:054614622558:job-definition/vol-app-dev-cancel-unsubmitted-bilateral:303",
                        ]
                      - Sid      = "batch"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        tags             = {
            "Name" = "vol-app-dev-batch-scheduler-inline"
        }
        # (7 unchanged attributes hidden)
    }

Plan: 1 to add, 6 to change, 1 to destroy.

```

</details>